{
  "1": {
    "title": "What is Bitcoin?",
    "body": "<p>Bitcoin is more than digital money—it's a revolutionary technology that allows anyone to send and store value globally, without banks or governments.</p><p>Key principles:</p><ul><li><strong>Decentralized:</strong> No central authority controls it.</li><li><strong>Limited Supply:</strong> Only 21 million will ever exist.</li><li><strong>Borderless:</strong> Send it to anyone, anywhere in the world.</li><li><strong>Secure:</strong> You alone control your private keys.</li></ul><p>Bitcoin is freedom in digital form.</p>",
    "image": "/assets/challenge/1.webp",
    "releaseDate": "2025-07-11",
    "references": [
      {
        "title": "Getting Started with Bitcoin",
        "url": "https://mappingbitcoin.com/learn/getting-started-bitcoin"
      },
      {
        "title": "How Does Bitcoin Work?",
        "url": "https://mappingbitcoin.com/learn/how-does-bitcoin-work"
      }
    ]
  },
  "2": {
    "title": "Why Bitcoin Matters?",
    "body": "<p>Bitcoin separates money from government control and central banks. It gives people financial freedom, especially in countries with high inflation or unstable currencies.</p><p>Before Bitcoin, money was always controlled by rulers, kings, or bankers. Bitcoin is the first money that belongs to everyone, and no one can shut it down.</p><ul><li><strong>No censorship:</strong> Anyone can use it, no matter where they live.</li><li><strong>Resistant to inflation:</strong> No one can print more than 21 million.</li><li><strong>Protects savings:</strong> Your money won't lose value just because of politics.</li></ul>",
    "image": "/assets/challenge/2.webp",
    "releaseDate": "2025-07-12"
  },
  "3": {
    "title": "Properties of Sound Money",
    "body": "<p>Not all money is created equal. Over time, societies have gravitated toward money with certain key traits. Economists call this <strong>sound money</strong>—money that holds its value over time and is hard to corrupt.</p><ul><li><strong>Scarcity:</strong> It must be limited in supply to preserve purchasing power.</li><li><strong>Durability:</strong> It must last over time without degrading.</li><li><strong>Divisibility:</strong> It must be usable in small or large amounts.</li><li><strong>Portability:</strong> It must be easy to transfer across distances.</li><li><strong>Fungibility:</strong> Every unit must be interchangeable.</li><li><strong>Verifiability:</strong> Easy to confirm authenticity.</li></ul><p>Gold once fit this description. Today, Bitcoin is the first digital money that meets all these criteria.</p>",
    "image": "/assets/challenge/3.webp",
    "releaseDate": "2025-07-13"
  },
  "4": {
    "title": "The Hidden Tax of Inflation",
    "body": "<p>Inflation is often called the \"hidden tax\" because it silently erodes the purchasing power of your money. When central banks print more money, each dollar in your wallet becomes worth less.</p><p>Fiat currencies (government-issued money not backed by commodities) have a 100% failure rate throughout history. The average lifespan of a fiat currency is only 27 years.</p><p>Bitcoin's fixed supply of 21 million coins makes it immune to monetary inflation. While prices may fluctuate, no government or central bank can devalue Bitcoin by creating more units.</p>",
    "image": "/assets/challenge/4.webp",
    "releaseDate": "2025-07-14"
  },
  "5": {
    "title": "Austrian Economics and Time Preference",
    "body": "<p>Austrian economics provides the theoretical foundation for understanding Bitcoin's value proposition. Unlike Keynesian economics, which favors government spending and monetary expansion, Austrian theory advocates for sound money and individual decision-making.</p><p>One key concept is <strong>time preference</strong>—the idea that people value present goods more than future ones. In societies with stable, hard money, people tend to save and invest long-term. But with inflationary money, people are incentivized to consume quickly, knowing their money will lose value.</p><p>Bitcoin, with its fixed supply, encourages low time preference—saving and planning for the future.</p>",
    "image": "/assets/challenge/5.webp",
    "releaseDate": "2025-07-15"
  },
  "6": {
    "title": "Central Banking and the Money Printer",
    "body": "<p>Central banks were originally created to provide financial stability, but they've become tools for economic manipulation. They control interest rates, money supply, and can create currency out of thin air.</p><p>Problems with central banking:</p><ul><li><strong>Boom and bust cycles</strong> created by artificial interest rate manipulation</li><li><strong>Currency debasement</strong> through quantitative easing</li><li><strong>Moral hazard</strong> by bailing out failing institutions</li><li><strong>Wealth inequality</strong> as newly printed money benefits those closest to the money printer first</li></ul><p>Bitcoin eliminates the need for central banks by providing a self-regulating monetary system with predictable supply and transparent rules.</p>",
    "image": "/assets/challenge/6.webp",
    "releaseDate": "2025-07-16"
  },
  "7": {
    "title": "Solving the Digital Scarcity Problem",
    "body": "<p>Before Bitcoin, digital scarcity was impossible. Any digital file could be copied infinitely. This \"double-spending problem\" prevented the creation of digital money without a trusted third party.</p><p>Satoshi Nakamoto solved this in 2008 by creating the first digital asset that couldn't be duplicated. Bitcoin uses cryptographic proof instead of trust, making it the first form of digital scarcity.</p><p>The Bitcoin network launched on January 3, 2009, with the genesis block containing the message: \"The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.\" This wasn't just a timestamp—it was a statement about Bitcoin's purpose.</p>",
    "image": "/assets/challenge/7.webp",
    "releaseDate": "2025-07-17",
    "references": [
      {
        "title": "Bitcoin Whitepaper, Explained",
        "url": "https://mappingbitcoin.com/learn/bitcoin-white-paper"
      },
      {
        "title": "The Bitcoin Whitepaper",
        "url": "https://bitcoin.org/bitcoin.pdf"
      }
    ]
  },
  "8": {
    "title": "Understanding the Blockchain",
    "body": "<p>Think of the blockchain as a digital ledger that records every Bitcoin transaction ever made. Unlike a traditional ledger controlled by a bank, Bitcoin's blockchain is maintained by thousands of computers worldwide.</p><p>Each \"block\" contains transaction data and is linked to the previous block using cryptographic hashes, creating an unbreakable chain. This design makes it impossible to alter past transactions without changing every subsequent block.</p><p>The blockchain provides transparency (anyone can verify transactions) while maintaining privacy (transactions are pseudonymous, not tied to real names).</p>",
    "image": "/assets/challenge/8.webp",
    "releaseDate": "2025-07-18"
  },
  "9": {
    "title": "The Anatomy of a Bitcoin Transaction",
    "body": "<p>A Bitcoin transaction is like sending a digital letter that everyone can see but only the recipient can open. When you send Bitcoin, you're not actually sending coins—you're transferring ownership recorded on the blockchain.</p><ul><li>Inputs: References to previous transactions you received</li><li>Outputs: New ownership assignments</li><li>Digital signatures: Cryptographic proof that you own the Bitcoin</li><li>Transaction fees: Small payments to miners for processing</li></ul><p>Transactions are broadcast to the network, verified by nodes, and included in blocks by miners. Once confirmed, they become permanent and irreversible.</p>",
    "image": "/assets/challenge/9.webp",
    "releaseDate": "2025-07-19"
  },
  "10": {
    "title": "Your Keys, Your Bitcoin",
    "body": "<p>Bitcoin ownership is based on cryptographic key pairs: a private key (secret) and a public key (shareable). Think of your public key as your Bitcoin address—like an email address where others can send you Bitcoin. Your private key is like a password that proves ownership. Anyone with your private key can spend your Bitcoin, which is why the phrase 'not your keys, not your coins' is fundamental to Bitcoin security.</p><ul><li>Private keys are 256-bit numbers with 2^256 possible combinations</li><li>The probability of guessing someone's private key is astronomically small</li><li>Public keys are derived from private keys using mathematical functions</li><li>You can share your public key safely but must keep your private key secret</li></ul>",
    "image": "/assets/challenge/10.webp",
    "releaseDate": "2025-07-20"
  },
  "11": {
    "title": "Bitcoin Mining & Proof of Work",
    "body": "<p>Mining secures Bitcoin by validating transactions through computing power. Miners compete to solve complex mathematical puzzles, and the winner gets to add the next block to the blockchain and receive newly created Bitcoin as a reward.</p><p>This process, called Proof of Work, ensures network security because attacking Bitcoin would require more computing power than the rest of the network combined—making attacks extremely expensive.</p><p>Mining also:</p><ul><li>Processes transactions without a central authority</li><li>Distributes new Bitcoin according to predetermined rules</li><li>Provides economic incentives for network security</li><li>Consumes energy, but this energy consumption is what makes Bitcoin secure</li></ul>",
    "image": "/assets/challenge/11.webp",
    "releaseDate": "2025-07-21"
  },
  "12": {
    "title": "The Bitcoin Supply Schedule",
    "body": "<p>Bitcoin's supply is mathematically limited to 21 million coins. New Bitcoin is created through mining rewards, which decrease by half approximately every four years in an event called 'the halving'.</p><p>Supply schedule:</p><ul><li>2009-2012: 50 BTC per block (10.5 million total)</li><li>2012-2016: 25 BTC per block (5.25 million additional)</li><li>2016-2020: 12.5 BTC per block (2.625 million additional)</li><li>2020-2024: 6.25 BTC per block (1.3125 million additional)</li><li>2024-2028: 3.125 BTC per block (0.656 million additional)</li></ul><p>This predictable supply reduction creates scarcity and has historically led to price appreciation as demand meets decreasing supply.</p>",
    "image": "/assets/challenge/12.webp",
    "releaseDate": "2025-07-22",
    "references": [
      {
        "title": "Bitcoin Halving Explained",
        "url": "https://www.investopedia.com/bitcoin-halving-4843769"
      },
      {
        "title": "Supply and Demand Economics",
        "url": "https://www.investopedia.com/terms/l/law-of-supply-demand.asp"
      }
    ]
  },
  "13": {
    "title": "Bitcoin Nodes and Network Decentralization",
    "body": "<p>Bitcoin nodes are computers that store a complete copy of the blockchain and enforce Bitcoin's rules. Anyone can run a node, and this distributed network is what makes Bitcoin truly decentralized.</p><p>Nodes perform critical functions:</p><ul><li>Validate transactions according to Bitcoin's rules</li><li>Store the complete blockchain history</li><li>Relay information to other nodes</li><li>Prevent invalid transactions from being accepted</li></ul><p>The more nodes in the network, the more decentralized and secure Bitcoin becomes. Unlike mining, running a node doesn't require expensive hardware—any computer can participate in securing the network.</p>",
    "image": "/assets/challenge/13.webp",
    "releaseDate": "2025-07-23"
  },
  "14": {
    "title": "Bitcoin vs. Altcoins: Understanding the Differences",
    "body": "<p>While thousands of cryptocurrencies exist, Bitcoin remains unique in its purpose, security, and adoption. Most alternative cryptocurrencies (altcoins) make different trade-offs that compromise decentralization or security.</p><ul><li>Network effect: Bitcoin has the largest, most secure network</li><li>Immutable monetary policy: Bitcoin's rules are extremely difficult to change</li><li>Proof of Work: The most secure consensus mechanism</li><li>Simplicity: Bitcoin does one thing well—being money</li><li>Decentralization: No single entity controls Bitcoin</li></ul><p>Many altcoins promise additional features but often sacrifice Bitcoin's core properties of decentralization, security, and monetary soundness.</p>",
    "image": "/assets/challenge/14.webp",
    "releaseDate": "2025-07-24"
  },
  "15": {
    "title": "Self-Custody: Taking Control of Your Bitcoin",
    "body": "<p>The fundamental principle of Bitcoin is self-sovereignty: you control your money without depending on banks or third parties. This requires understanding the difference between custodial and non-custodial storage.</p><ul><li>Custodial storage: Exchanges or services hold your private keys. Pros: Convenient, familiar user experience. Cons: Counterparty risk, potential loss of funds, not your keys</li><li>Non-custodial storage: You control your private keys. Pros: True ownership, no counterparty risk, aligned with Bitcoin's purpose. Cons: Requires responsibility and technical knowledge</li></ul><p>Self-custody means you're your own bank—with the freedom and responsibility that entails.</p>",
    "image": "/assets/challenge/15.webp",
    "releaseDate": "2025-07-25"
  },
  "16": {
    "title": "Bitcoin Wallets",
    "body": "<p>Wallets store your Bitcoin keys, giving you control of your Bitcoin. Understanding different wallet types helps you choose the right security level for your needs.</p><ul><li><strong>Hot wallets:</strong> Connected to the internet<ul><li>Mobile apps (convenient for small amounts)</li><li>Desktop software (good for regular use)</li><li>Web wallets (least secure, use sparingly)</li></ul></li><li><strong>Cold wallets:</strong> Offline storage<ul><li>Hardware wallets (recommended for larger amounts)</li><li>Paper wallets (secure but require careful handling)</li><li>Air-gapped computers (advanced users)</li></ul></li></ul><p>The general rule: use hot wallets for spending money and cold wallets for saving money.</p>",
    "image": "/assets/challenge/16.webp",
    "releaseDate": "2025-07-26"
  },
  "17": {
    "title": "Bitcoin for Financial Freedom",
    "body": "<p>Bitcoin enables financial freedom by removing barriers that traditional financial systems impose. It provides equal access to sound money regardless of geography, politics, or social status.</p><ul><li>Borderless transactions: Send money anywhere instantly</li><li>Banking the unbanked: Access financial services without traditional banks</li><li>Inflation protection: Preserve purchasing power over time</li><li>Censorship resistance: No one can freeze or seize your Bitcoin</li><li>24/7 availability: No business hours or holidays</li></ul><p>Bitcoin democratizes access to sound money and financial services, empowering individuals to control their financial destiny.</p>",
    "image": "/assets/challenge/17.webp",
    "releaseDate": "2025-07-27"
  },
  "18": {
    "title": "Debunking Bitcoin Misconceptions",
    "body": "<p>Despite growing adoption, many myths persist about Bitcoin. Understanding these misconceptions helps separate fact from fiction.</p><ul><li>Myth 1: 'Bitcoin is used mainly for illegal activities'</li><li>Reality: Less than 1% of Bitcoin transactions are illicit. Cash is used far more for illegal activities.</li><li>Myth 2: 'Bitcoin is bad for the environment'</li><li>Reality: Bitcoin incentivizes renewable energy and can help stabilize electrical grids.</li><li>Myth 3: 'Bitcoin is too volatile to be money'</li><li>Reality: Volatility decreases as adoption grows. Early internet stocks were also volatile.</li><li>Myth 4: 'Governments will ban Bitcoin'</li><li>Reality: Banning Bitcoin is like banning mathematics—technically impossible and economically counterproductive.</li></ul>",
    "image": "/assets/challenge/18.webp",
    "releaseDate": "2025-07-28"
  },
  "19": {
    "title": "Bitcoin's Impact on Developing Economies",
    "body": "<p>Bitcoin has the greatest impact in countries with unstable currencies, limited banking infrastructure, or authoritarian governments. It provides economic stability and financial inclusion where traditional systems fail.</p><p>Real-world applications:</p><ul><li>Remittances: Lower-cost international money transfers</li><li>Savings protection: Hedge against local currency devaluation</li><li>Business payments: Enable international commerce</li><li>Financial services: Access to global financial markets</li></ul><p>Countries like El Salvador, Nigeria, and parts of Latin America show how Bitcoin can provide economic opportunities and stability in challenging environments.</p>",
    "image": "/assets/challenge/19.webp",
    "releaseDate": "2025-07-29"
  },
  "20": {
    "title": "Bitcoin as a Human Rights Tool",
    "body": "<p>Access to sound money is a fundamental human right. Bitcoin enables financial freedom for people living under oppressive regimes, experiencing economic instability, or facing discrimination from traditional financial systems.</p><ul><li>Freedom of association: Support causes without financial censorship</li><li>Economic participation: Access global markets regardless of location</li><li>Protection from seizure: Secure wealth from authoritarian governments</li><li>Equal access: No discrimination based on race, gender, or nationality.</li></ul><p>Bitcoin's neutral, permissionless nature makes it a powerful tool for human rights advocacy and individual sovereignty.</p>",
    "image": "/assets/challenge/20.webp",
    "releaseDate": "2025-07-30"
  },
  "21": {
    "title": "The Future of Bitcoin",
    "body": "<p>After 21 days of learning, you now understand Bitcoin's revolutionary potential. Bitcoin isn't just a new form of money—it's a new monetary system that empowers individuals and constrains governments.</p><ul><li>Sound money properties: Bitcoin is the hardest money ever created</li><li>Decentralization: No single point of failure or control</li><li>Global accessibility: Available to anyone with internet access</li><li>Technological innovation: Continues to evolve and improve</li><li>Growing adoption: Individuals, companies, and countries are adopting Bitcoin</li></ul><p>Bitcoin's future depends on education, adoption, and infrastructure development. As a finance student, you're positioned to help shape this monetary revolution.</p>",
    "image": "/assets/challenge/21.webp",
    "releaseDate": "2025-07-31"
  }
}
